There is a bug in the API. It doesn't return encryption_spec fields.

The whole reason for using this resource is to support CMEK and the API doesn't even return those fields  😕 

```
021/07/05 19:04:19 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
POST /v1beta1/projects/REDACTED/locations/us-central1/metadataStores?alt=json&metadataStoreId=tf-test-2weojyw8lj HTTP/1.1
Host: us-central1-aiplatform.googleapis.com
User-Agent: Terraform/0.14.7 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google-beta/acc
Content-Length: 169
Content-Type: application/json
Accept-Encoding: gzip

{
 "description": "Magic",
 "encryptionSpec": {
  "kmsKeyName": "projects/REDACTED/locations/us-central1/keyRings/tftest-shared-keyring-1/cryptoKeys/tftest-shared-key-1"
 }
}

-----------------------------------------------------
2021/07/05 19:04:20 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 05 Jul 2021 18:04:20 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "name": "projects/550924169191/locations/us-central1/operations/616599798664921088",
  "metadata": {
    "@type": "type.googleapis.com/google.cloud.aiplatform.v1beta1.CreateMetadataStoreOperationMetadata",
    "genericMetadata": {
      "createTime": "2021-07-05T18:04:20.582962Z",
      "updateTime": "2021-07-05T18:04:20.582962Z"
    }
  }
}

-----------------------------------------------------
2021/07/05 19:04:20 [DEBUG] Retry Transport: Stopping retries, last request was successful
2021/07/05 19:04:20 [DEBUG] Retry Transport: Returning after 1 attempts
2021/07/05 19:04:20 [DEBUG] Waiting for state to become: [done: true]
2021/07/05 19:04:20 [DEBUG] Waiting for state to become: [success]
2021/07/05 19:04:20 [DEBUG] Retry Transport: starting RoundTrip retry loop
2021/07/05 19:04:20 [DEBUG] Retry Transport: request attempt 0
2021/07/05 19:04:20 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /v1beta1/projects/550924169191/locations/us-central1/operations/616599798664921088?alt=json HTTP/1.1
Host: us-central1-aiplatform.googleapis.com
User-Agent: Terraform/0.14.7 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google-beta/acc
Content-Type: application/json
Accept-Encoding: gzip


-----------------------------------------------------
2021/07/05 19:04:21 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 05 Jul 2021 18:04:21 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "name": "projects/550924169191/locations/us-central1/operations/616599798664921088",
  "metadata": {
    "@type": "type.googleapis.com/google.cloud.aiplatform.v1beta1.CreateMetadataStoreOperationMetadata",
    "genericMetadata": {
      "createTime": "2021-07-05T18:04:20.582962Z",
      "updateTime": "2021-07-05T18:04:20.582962Z"
    }
  }
}

-----------------------------------------------------
2021/07/05 19:04:21 [DEBUG] Retry Transport: Stopping retries, last request was successful
2021/07/05 19:04:21 [DEBUG] Retry Transport: Returning after 1 attempts
2021/07/05 19:04:21 [DEBUG] Got done: false while polling for operation projects/550924169191/locations/us-central1/operations/616599798664921088's status
2021/07/05 19:04:31 [DEBUG] Waiting for state to become: [success]
2021/07/05 19:04:31 [DEBUG] Retry Transport: starting RoundTrip retry loop
2021/07/05 19:04:31 [DEBUG] Retry Transport: request attempt 0
2021/07/05 19:04:31 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /v1beta1/projects/550924169191/locations/us-central1/operations/616599798664921088?alt=json HTTP/1.1
Host: us-central1-aiplatform.googleapis.com
User-Agent: Terraform/0.14.7 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google-beta/acc
Content-Type: application/json
Accept-Encoding: gzip


-----------------------------------------------------
2021/07/05 19:04:31 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 05 Jul 2021 18:04:31 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "name": "projects/550924169191/locations/us-central1/operations/616599798664921088",
  "metadata": {
    "@type": "type.googleapis.com/google.cloud.aiplatform.v1beta1.CreateMetadataStoreOperationMetadata",
    "genericMetadata": {
      "createTime": "2021-07-05T18:04:20.582962Z",
      "updateTime": "2021-07-05T18:04:21.980978Z"
    }
  },
  "done": true,
  "response": {
    "@type": "type.googleapis.com/google.cloud.aiplatform.v1beta1.MetadataStore",
    "name": "projects/550924169191/locations/us-central1/metadataStores/tf-test-2weojyw8lj"
  }
}

-----------------------------------------------------
2021/07/05 19:04:31 [DEBUG] Retry Transport: Stopping retries, last request was successful
2021/07/05 19:04:31 [DEBUG] Retry Transport: Returning after 1 attempts
2021/07/05 19:04:31 [DEBUG] Got done: true while polling for operation projects/550924169191/locations/us-central1/operations/616599798664921088's status
2021/07/05 19:04:31 [DEBUG] Finished creating MetadataStore "tf-test-2weojyw8lj": map[string]interface {}{"metadata":map[string]interface {}{"@type":"type.googleapis.com/google.cloud.aiplatform.v1beta1.CreateMetadataStoreOperationMetadata", "genericMetadata":map[string]interface {}{"createTime":"2021-07-05T18:04:20.582962Z", "updateTime":"2021-07-05T18:04:20.582962Z"}}, "name":"projects/550924169191/locations/us-central1/operations/616599798664921088"}
2021/07/05 19:04:31 [DEBUG] Waiting for state to become: [success]
2021/07/05 19:04:31 [DEBUG] Retry Transport: starting RoundTrip retry loop
2021/07/05 19:04:31 [DEBUG] Retry Transport: request attempt 0
2021/07/05 19:04:31 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /v1beta1/projects/REDACTED/locations/us-central1/metadataStores/tf-test-2weojyw8lj?alt=json HTTP/1.1
Host: us-central1-aiplatform.googleapis.com
User-Agent: Terraform/0.14.7 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google-beta/acc
Content-Type: application/json
Accept-Encoding: gzip


-----------------------------------------------------
2021/07/05 19:04:32 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 05 Jul 2021 18:04:32 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "name": "projects/550924169191/locations/us-central1/metadataStores/tf-test-2weojyw8lj",
  "createTime": "2021-07-05T18:04:20.582962Z",
  "updateTime": "2021-07-05T18:04:22.015587Z",
  "state": {
    "diskUtilizationBytes": "851968"
  }
}

-----------------------------------------------------
2021/07/05 19:04:32 [DEBUG] Retry Transport: Stopping retries, last request was successful
2021/07/05 19:04:32 [DEBUG] Retry Transport: Returning after 1 attempts
2021/07/05 19:04:37 [INFO] Authenticating using DefaultClient...
2021/07/05 19:04:37 [INFO]   -- Scopes: [https://www.googleapis.com/auth/compute https://www.googleapis.com/auth/cloud-platform https://www.googleapis.com/auth/cloud-identity https://www.googleapis.com/auth/ndev.clouddns.readwrite https://www.googleapis.com/auth/devstorage.full_control https://www.googleapis.com/auth/userinfo.email]
2021/07/05 19:04:37 [INFO] Authenticating using DefaultClient...
2021/07/05 19:04:37 [INFO]   -- Scopes: [https://www.googleapis.com/auth/compute https://www.googleapis.com/auth/cloud-platform https://www.googleapis.com/auth/cloud-identity https://www.googleapis.com/auth/ndev.clouddns.readwrite https://www.googleapis.com/auth/devstorage.full_control https://www.googleapis.com/auth/userinfo.email]
2021/07/05 19:04:37 [DEBUG] Waiting for state to become: [success]
2021/07/05 19:04:37 [INFO] Terraform is using this identity: REDACTED
    provider_test.go:276: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # google_vertex_ai_metadata_store.store must be replaced
        -/+ resource "google_vertex_ai_metadata_store" "store" {
              ~ create_time = "2021-07-05T18:04:20.582962Z" -> (known after apply)
              + description = "Magic"
              ~ id          = "tf-test-2weojyw8lj" -> (known after apply)
                name        = "tf-test-2weojyw8lj"
              ~ project     = "REDACTED" -> (known after apply)
              ~ state       = [
                  - {
                      - disk_utilization_bytes = "851968"
                    },
                ] -> (known after apply)
              ~ update_time = "2021-07-05T18:04:22.015587Z" -> (known after apply)
                # (1 unchanged attribute hidden)
        
              + encryption_spec {
                  + kms_key_name = "projects/REDACTED/locations/us-central1/keyRings/tftest-shared-keyring-1/cryptoKeys/tftest-shared-key-1"
                }
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
```